[
  {
    "awards": [
      {
        "event": "UW Maker Summit 2017",
        "name": "Winner - Gizmos (Graduate)",
        "link": "http://www.dailyuw.com/news/article_113480d8-28a0-11e7-9650-a79c09a75a1d.html"
      }, {
        "event": "UW HCDE Open House 2017",
        "name": "Judge's Honorable Mention - Technology",
        "link": "https://www.hcde.washington.edu/node/1655"
      }, {
        "event": "UW HCDE Graduate Award 2017",
        "name": "Graduate Award for Innovation",
        "link": "https://www.hcde.washington.edu/news/2017-graduation-and-awards-ceremony"
      }
    ],
    "color": "rgb(249, 165, 27)",
    "coverPhotoURL": "/assets/projects/sim-the-social-robot/cover.png",
    "description": "<blockquote><p>How might we design natural and intuitive interactions between humans and robots?</p></blockquote><p>The idea to build SIM was conceived after my team and I observed struggles in different interaction patterns with robotics projects that we had been involved with. We concluded that existing interaction patterns were both unnatural and forced upon the user, and we sought to create a more natural experience, by applying the Human-Centered Design process.</p><p>The goal of SIM was to build a prototype robot that could engage in affective interactions by both understanding an expressing emotion. Expressions of emotion is a complex subject, involving a number of human factors, such a facial expressions, tone of voice, and body language. In order to keep ourselves on track, we decided to focus on facial expressions. We devised a behavioral model &mdash; aptly named the  <em>S</em>ocial <em>I</em>nteraction <em>M</em>odel &mdash; of antecedent conditions, facial emotions of the human, and &quot;goal&quot; states to define how SIM would react to an emotional stimulus in a given situation, and how that emotional response would affect the dynamics of that interaction. Our hope was for this model would create the illusion of &quot;social intelligence&quot; in the robot, creating a more desirable experience for the user.</p><div class='inline-image left'><img src='/assets/projects/sim-the-social-robot/113663ca.jpg' /><div class='caption'>Testing participant with SIM.</div></div><p>Our testing focus on a user building trust with SIM, and if a higher level of trust was achieved when the robot expressed social intelligence. Each testing session consisted of two rounds: one where the Social Interaction Model was enabled, and another where it was not. In each round, the user was asked SIM a set of questions with no true &quot;right&quot; answer, such as picking the dominant color in an image, and SIM would either agree or disagree with the user's answer. We observed how the SIM's response affected the user's behavior throughout the test, such as if the user changed thier original answer.</p><p>SIM has two major components: an Android smartphone that functions as a face, and a body made up of three Dynamixel AX-18A servo motors powered by a Raspberry Pi 3.</p><p>SIM uses the Android smartphone as its central processor. The screen acts as the robot’s face, while the camera is used to capture a live video of a user. Onboard emotional processing software analyzes the user’s facial expressions from this video and provides information about the user’s emotions. This information is then passed through a social interaction model which generates an appropriate response for the robot. The chosen response is composed of an animated facial expression that is rendered on the smartphone’s screen, and a message containing desired body movements that is transmitted to the Raspberry Pi via Bluetooth.</p><p>The body’s servos are positioned in such a way that allows for 3 degrees of motion: one on the pitch axis and two on the yaw axis. The message from the smartphone contains instructions for each servo, resulting in a physical animation that corresponds with SIM’s facial expression.</p>",
    "endDate": null,
    "gallery": [
      {
        "url": "/assets/projects/sim-the-social-robot/a9ed7a71.jpg",
        "thumbnailUrl": "/assets/projects/sim-the-social-robot/a9ed7a71.thumb.jpg",
        "title": "John 3D Printing parts for SIM."
      },
      {
        "url": "/assets/projects/sim-the-social-robot/8e16bd5f.jpg",
        "thumbnailUrl": "/assets/projects/sim-the-social-robot/8e16bd5f.thumb.jpg",
        "title": "3D printed component for the Android smartphone component of SIM."
      },
      {
        "url": "/assets/projects/sim-the-social-robot/22c04b79.jpg",
        "thumbnailUrl": "/assets/projects/sim-the-social-robot/22c04b79.thumb.jpg",
        "title": "SIM prototype fully constructed."
      },
      {
        "url": "/assets/projects/sim-the-social-robot/5361a677.jpg",
        "thumbnailUrl": "/assets/projects/sim-the-social-robot/5361a677.thumb.jpg",
        "title": "Close-up of the physical embodiment of SIM."
      },
      {
        "url": "/assets/projects/sim-the-social-robot/SIM_Poster.pdf",
        "thumbnailUrl": "/assets/projects/sim-the-social-robot/SIM_Poster.thumb.png",
        "title": "24\"x36\" poster describing SIM."
      },
      {
        "url": "/assets/projects/sim-the-social-robot/SIM_Process_Book.pdf",
        "thumbnailUrl": "/assets/projects/sim-the-social-robot/SIM_Process_Book.thumb.png",
        "title": "SIM Process Book."
      },
      {
        "url": "/assets/projects/sim-the-social-robot/cc93db48.jpg",
        "thumbnailUrl": "/assets/projects/sim-the-social-robot/cc93db48.thumb.jpg",
        "title": "John, Nikhil, Dorothy and Sahil after SIM won the Gizmos - Graduate prizes at the 2017 UW Maker Summit"
      },
      {
        "url": "/assets/projects/sim-the-social-robot/371267af.jpg",
        "thumbnailUrl": "/assets/projects/sim-the-social-robot/371267af.thumb.jpg",
        "title": "2017 UW Maker Summit Awards for Gizmos - Graduate."
      },
      {
        "url": "/assets/projects/sim-the-social-robot/ce860846.jpg",
        "thumbnailUrl": "/assets/projects/sim-the-social-robot/ce860846.thumb.jpg",
        "title": "HCDE Chair David McDonald with Nikhil, Dorothy and John after receiving the Judge's Honorable Mention as the 2017 HCDE Open House."
      }
    ],
    "members": [
      {
        "name": "Sahil Anand"
      },
      {
        "name": "Nikhil Venkatesh"
      },
      {
        "name": "Dorothy Wong"
      }
    ],
    "name": "SIM: The Social Robot",
    "responsibilities": [
      "Physical Prototyping",
      "Software Engineering",
      "User test moderation"
    ],
    "startDate": "2016-08-30",
    "summary": "SIM is a functional prototype of a socially intelligent robot that can understand and respond to expressions on a user's face. SIM was built for the capstone project of my graduate degree from the <a href='https://hcde.uw.edu'>Human-Centered Design and Engineering</a> program at the <a href='https://uw.edu'>University of Washington</a>.",
    "tagline": "Designing Expressive Behaviors to Improve Human-Robot Relationships",
    "website": "http://simthesocialrobot.com"
  },
  {
    "awards": [],
    "color": "rgb(67, 107, 113)",
    "coverPhotoURL": "/assets/projects/this-or-this-fictitious-lecture-series/cover.png",
    "description": "<p>&quot;This or This&quot; focused on the methods of interacting with machines shifting from a specially-design device, such as a mouse, keyboard or pen, to a natural capability, such as touch or voice.</p>",
    "endDate": "2015-08-01",
    "gallery": [
      {
        "url": "/assets/projects/this-or-this-fictitious-lecture-series/This_or_This_Poster.pdf",
        "title": "Lecture Series Poster"
      }
    ],
    "members": [],
    "name": "This or This: Fictitious Lecture Series",
    "responsibilities": [
      "Visual Design",
      "Web Design"
    ],
    "startDate": "2015-06-01",
    "summary": "&quot;This or This&quot; is a fictitious lecture series that I concocted in order to create a set of visuals to brand an generate excitement about an event. This was a class project though for my graduate degree from the <a href='https://hcde.uw.edu'>Human-Centered Design and Engineering</a> program at the <a href='https://uw.edu'>University of Washington</a>.",
    "website": "/508Conference"
  },
  {
    "awards": [],
    "color": "rgb(198, 94, 50)",
    "coverPhotoURL": "/assets/projects/usability-testing-smashing-ideas/cover.png",
    "description": "<blockquote><p>How might we change our internal tools to better meet our needs?</p></blockquote><p>Smashing Ideas wanted optimized thier internal workflow tools for better team efficiency. We were tasked to provide insights and suggestions on making or re-configuring better tools to meet SI's daily project needs.</p><p>An NDA prevents discussing specifics of this project.</p>",
    "endDate": "2015-06-01",
    "gallery": [
      {
        "url": "/assets/projects/usability-testing-smashing-ideas/SI_Team_Photo.jpg"
      }
    ],
    "members": [],
    "name": "Usability Testing: Smashing Ideas",
    "responsibilities": [
      "Usability Test Design",
      "User Test Moderation"
    ],
    "startDate": "2015-03-01",
    "summary": "Contracted with <a href='https://smashingideas.com'>Smashing Ideas</a>, a Seattle digital engagement agency, though the <a href='https://hcde.uw.edu'>University of Washington</a> to create and execute a usability test for proposed changes to an internal workflow tool.",
    "website": null
  },
  {
    "awards": [],
    "color": "rgb(36, 66, 60)",
    "coverPhotoURL": "/assets/projects/findcheeseheads/cover.png",
    "description": null,
    "endDate": null,
    "gallery": [],
    "members": [],
    "name": "FindCheeseheads.com",
    "startDate": "2015-09-03",
    "summary": "FindCheeseheads is a community-driven website for locating and rating &quot;Packer bars&quot; across the US. It spawned from a <a href='https://redd.it/3jijac' target='_blank'>post on /r/greenbaypackers</a>.",
    "website": "https://findcheeseheads.com"
  },
  {
    "awards": [],
    "color": null,
    "coverPhotoURL": "/assets/projects/stat-tracker/thumbnail.png",
    "description": "Stat Tracker is a hostable web app that allows Ingress agents to upload data from thier agent profile and receive insights into thier individual and local team performance. Given multiple data points, Stat Tracker will perform linear regression and predict how long it would take an individual agent to earn a badge. Agents can track thier progress over the past week, month, or all-time see how they stack up against other members of thier local team via leaderboards or insights into which aspects of the game their local team favors.<p/>Agents can upload their statics via manual entry or via a screenshot of thier agent profile. The screenshot would be processed via OCR and statistics extracted automatically. And API is also available for agents to use thier stats however they pleased.",
    "endDate": "2016-06-20",
    "gallery": [
      {
        "url": "/assets/projects/stat-tracker/92db58ad.png",
        "title": "A pie chart is available to each agent that breaks down how their AP was acquired."
      },
      {
        "url": "/assets/projects/stat-tracker/8345cff1.png",
        "title": "Multple ways are available for agents to input their statistics."
      },
      {
        "url": "/assets/projects/stat-tracker/9ae95f33.png",
        "title": "Agents could create an access token to upload or access data outaside of the website."
      }
    ],
    "members": [],
    "name": "Stat Tracker",
    "responsibilities": [
      "API Design",
      "Data Visualization",
      "Web Design"
    ],
    "startDate": "2014-04-22",
    "summary": "Stat Tracker is a web app to track stats and predict badges for <a href='//ingress.com'>Ingress</a> agents.",
    "website": "https://github.com/johnluetke/StatTracker"
  },
  {
    "awards": [],
    "color": null,
    "coverPhotoURL": null,
    "description": null,
    "endDate": null,
    "gallery": [],
    "members": [],
    "name": "911 Dispatch",
    "startDate": "2012-05-03",
    "summary": null,
    "website": null
  },
  {
    "awards": [],
    "color": null,
    "coverPhotoURL": "/assets/projects/nr13-romeo-08/cover.png",
    "description": "<p>The augmented-reality game <em>Ingress</em> contains a mechanic where the competing factions gain a mind-unit score at every 5 hour checkpoint. Every 175 hours, the faction with the highest mind-unit score 'wins the cycle'. This website catalouges a historic record of the cycles, as <em>Ingress</em> does not provide a native interface to this data.</p><blockquote>[That's] a wonderful idea ... I like it.<br/><cite>Andrew Krug, Ingress Community Manager <sup><a href='https://plus.google.com/+AndrewKrug/posts/dm6cCVnFCbn'>ref</a></sup></cite></blockquote><p>The site has been well-recieved by both factions, as well as the community at large. It has spread to <a href='http://nr13-romeo-02.com'>other</a> <a href='http://nr13-romeo-03.com'>regions</a> in the Pacific Northwest, as well as <a href='http://allcells.willbe.blue/'>globally through a community-driven effort.</a></p><p>My biggest challenge with the project was coming up with a novel way to display historical data. A simple list would have sufficied, but, given the binary possibilites of outcomes, I felt like I could do something more. I can't recall exactly what inspired me, but I do remember thinking to myself that a sort of timeline would be the best approach. Visualizing the individual cycles as point on that timeline and coloring them to the faction that won was the obivous direction. As vertical list of blocks, the data seem like it was being presented in an uniteresting way. I applied the revolutionary idea of rotating it 90 degress, resulting in the wrapped, horizontal timeline. After launching the site, I had some interesting feedback presented to me : &quot;It's fun that we can draw pictures on the site by playing the game&quot;.</p><p>In addition to the main timelime visualization, I also present other statistics about the region, such as the overall count of cycles won by each faction, the the cumluative mind-unit score, and longest streaks.",
    "endDate": null,
    "gallery": [],
    "members": [],
    "name": "nr13-romeo-08.com",
    "responsibilities": [
      "Data Visualization",
      "Web Design"
    ],
    "startDate": "2016-05-03",
    "summary": "nr13-romeo-08.com is a score tracking website for <a href='https://ingress.com'>Ingress</a> agents in the NR13-ROMEO-08 (Greater Puget Sound) region. ",
    "website": "http://nr13-romeo-08.com"
  }
]
